ZehuiLi1/putttrack/firmware/nrf54l15_tag_app/src/main.c
/*
 * PuttTrack nRF54L15 Tag firmware.
 *
 * The Ball reports identity, health and generic raw motion. It deliberately
 * contains no player, hole, score or authoritative gameplay logic.
 */

#include <errno.h>
#include <limits.h>
#include <stdio.h>
#include <stdint.h>
#include <string.h>

#include <zephyr/bluetooth/bluetooth.h>
#include <zephyr/bluetooth/conn.h>
#include <zephyr/bluetooth/gatt.h>
#include <zephyr/bluetooth/hci.h>
#include <zephyr/device.h>
#include <zephyr/drivers/hwinfo.h>
#include <zephyr/drivers/i2c.h>
#include <zephyr/drivers/sensor.h>
#include <zephyr/kernel.h>
#include <zephyr/linker/section_tags.h>
#include <zephyr/mgmt/mcumgr/mgmt/handlers.h>
#include <zephyr/mgmt/mcumgr/mgmt/mgmt.h>
#include <zephyr/mgmt/mcumgr/smp/smp.h>
#include <zephyr/mgmt/mcumgr/transport/smp_bt.h>
#include <zephyr/pm/device.h>
#include <zephyr/random/random.h>
#include <zephyr/sys/atomic.h>
#include <zephyr/sys/byteorder.h>
#include <zephyr/sys/reboot.h>
#include <zephyr/sys/util.h>
#include <zcbor_encode.h>

#if defined(CONFIG_PUTTTRACK_NFC_SERVICE)
#include <hal/nrf_nfct.h>
#include <nfc_t2t_lib.h>
#include <nfc/ndef/uri_msg.h>
#endif

#define PUTTTRACK_PROTOCOL_VERSION 1U
#define PUTTTRACK_FIRMWARE_VERSION "0.1.16"

#define PUTTTRACK_MGMT_GROUP_ID 64U
#define PUTTTRACK_MGMT_ID_STATUS 0U
#define PUTTTRACK_MGMT_ID_MOTION 1U
#define PUTTTRACK_MGMT_ID_WINDOW 2U
#define PUTTTRACK_MGMT_ID_FREEZE_HISTORY 3U
#define PUTTTRACK_MGMT_ID_FROZEN_CHUNK_BASE 4U
#define PUTTTRACK_MGMT_ID_POWER_AUTO 20U
#define PUTTTRACK_MGMT_ID_POWER_RESEARCH 21U
#define PUTTTRACK_MGMT_ID_POWER_IDLE 22U

#define STATUS_PACKET_SIZE 64U
#define MOTION_PACKET_SIZE 56U
#define MOTION_WINDOW_SAMPLES 64U
#define MOTION_HISTORY_SAMPLES 1024U
#define MOTION_FROZEN_CHUNKS (MOTION_HISTORY_SAMPLES / MOTION_WINDOW_SAMPLES)
#define MOTION_WINDOW_BYTES (MOTION_PACKET_SIZE * MOTION_WINDOW_SAMPLES)
#define MOTION_WINDOW_HEX_BYTES (MOTION_WINDOW_BYTES * 2U)

#define MOTION_STREAM_RATE_HZ 50U
#define ADXL367_ODR_HZ 100U
#define ADXL367_RANGE_G 2U
#define BMI270_ACCEL_ODR_HZ 100U
#define BMI270_ACCEL_RANGE_G 16U
#define BMI270_GYRO_ODR_HZ 100U
#define BMI270_GYRO_RANGE_DPS 2000U

#define IDLE_ADXL367_ODR_HZ 12U
#define IDLE_WAKE_SAMPLE_PERIOD_MS 160U
#define IDLE_ACTIVITY_REFERENCE_SETTLE_MS 160U
#define AUTO_IDLE_TIMEOUT_MS 30000U
#define IDLE_WAKE_DELTA_MICRO_MS2 500000
/*
 * Every recorded stationary data set stays below 0.3 m/s^2 sample-to-sample,
 * including the CR2032/SWD diagnostic that exposed sporadic 0.182 m/s^2
 * changes. Real handling and pickup records exceed this threshold repeatedly;
 * gyro activity remains an independent keep-awake condition.
 */
#define ACTIVE_DELTA_MICRO_MS2 300000
#define ACTIVE_GYRO_MICRO_RADS 80000
#define IDLE_WAKE_REQUIRED_SAMPLES 2U
#define SENSOR_FAILURE_STREAK_LIMIT 5U
#define SENSOR_RECOVERY_MAX_ATTEMPTS 3U
#define SENSOR_RECOVERY_RETRY_INITIAL_MS 1000U
#define SENSOR_RECOVERY_RETRY_SECOND_MS 5000U
#define SENSOR_REBOOT_QUIET_MS 10000U
#define SENSOR_REBOOT_GUARD_CLEAR_MS 300000U
#define IDLE_SENSOR_HEALTH_CHECK_MS 600000U
#define SUSPECT_SENSOR_HEALTH_CHECK_MS 1000U
#define SENSOR_RETENTION_MAGIC 0x50544831U
#define ADVERTISING_RETRY_MS 250U
#define IDLE_ADV_INTERVAL_MIN_MS 2000U
#define IDLE_ADV_INTERVAL_MAX_MS 2500U
#define ADXL367_ACT_INACT_CTL_REG 0x27U
#define ADXL367_INTMAP1_LOWER_REG 0x2aU
#define ADXL367_POWER_CTL_REG 0x2dU
#define ADXL367_ACT_INACT_MODE_MASK GENMASK(5, 0)
#define ADXL367_REFERENCED_ACTIVITY_ONLY (BIT(1) | BIT(0))
#define ADXL367_INTMAP_ACTIVITY_BIT BIT(4)
#define ADXL367_INTMAP_INACTIVITY_BIT BIT(5)
#define ADXL367_POWER_CTL_WAKEUP_BIT BIT(3)

/* Count a sample as clipped just before the configured full-scale rail. */
#define ADXL367_CLIP_MICRO_MS2 19221034
#define BMI270_ACCEL_CLIP_MICRO_MS2 153768272
#define BMI270_GYRO_CLIP_MICRO_RADS 34208453
#define DEVICE_ID_MAX_SIZE 16U
#define BOOT_ID_SIZE 8U
#define ADVERTISING_NAME_PREFIX "PuttTrack-"
#define ADVERTISING_NAME_SUFFIX_BYTES 4U
#define ADVERTISING_NAME_BUFFER_SIZE \
	(sizeof(ADVERTISING_NAME_PREFIX) + ADVERTISING_NAME_SUFFIX_BYTES * 2U)

#define STATUS_FLAG_ADXL367_READY BIT(0)
#define STATUS_FLAG_BMI270_READY  BIT(1)
#define STATUS_FLAG_NOTIFY_ACTIVE BIT(2)
#define STATUS_FLAG_RUNTIME_ACTIVE BIT(3)
#define STATUS_FLAG_POWER_AUTO BIT(4)
#define STATUS_FLAG_POWER_RESEARCH BIT(5)
#define STATUS_FLAG_POWER_IDLE BIT(6)

#define MOTION_FLAG_ADXL367_VALID BIT(0)
#define MOTION_FLAG_BMI270_VALID  BIT(1)

#define SENSOR_ERROR_ADXL367_FETCH BIT(0)
#define SENSOR_ERROR_ADXL367_READ  BIT(1)
#define SENSOR_ERROR_BMI270_FETCH  BIT(2)
#define SENSOR_ERROR_BMI270_ACCEL  BIT(3)
#define SENSOR_ERROR_BMI270_GYRO   BIT(4)

enum putttrack_power_policy {
	PUTTTRACK_POWER_AUTO = 0,
	PUTTTRACK_POWER_RESEARCH = 1,
	PUTTTRACK_POWER_IDLE = 2,
};

enum putttrack_runtime_state {
	PUTTTRACK_RUNTIME_ACTIVE = 0,
	PUTTTRACK_RUNTIME_IDLE = 1,
};

enum putttrack_sensor_health {
	PUTTTRACK_SENSOR_HEALTHY = 0,
	PUTTTRACK_SENSOR_SUSPECT = 1,
	PUTTTRACK_SENSOR_RECOVERING = 2,
	PUTTTRACK_SENSOR_DEGRADED = 3,
	PUTTTRACK_SENSOR_QUARANTINED = 4,
};

struct sensor_reboot_retention {
	uint32_t magic;
	uint32_t guard;
	uint32_t reboot_count;
	uint32_t last_fault_bits;
};

/* PuttTrack telemetry service: 8f3a1000-6e7d-4b9a-a6e8-3f3f7d2c0001. */
static const struct bt_uuid_128 putttrack_service_uuid = BT_UUID_INIT_128(
	BT_UUID_128_ENCODE(0x8f3a1000, 0x6e7d, 0x4b9a, 0xa6e8, 0x3f3f7d2c0001));
static const struct bt_uuid_128 putttrack_status_uuid = BT_UUID_INIT_128(
	BT_UUID_128_ENCODE(0x8f3a1001, 0x6e7d, 0x4b9a, 0xa6e8, 0x3f3f7d2c0001));
static const struct bt_uuid_128 putttrack_motion_uuid = BT_UUID_INIT_128(
	BT_UUID_128_ENCODE(0x8f3a1002, 0x6e7d, 0x4b9a, 0xa6e8, 0x3f3f7d2c0001));

static const struct device *const adxl367 = DEVICE_DT_GET(DT_NODELABEL(adxl367));
static const struct device *const bmi270 = DEVICE_DT_GET(DT_NODELABEL(bmi270));
static const struct device *const bmi270_spi = DEVICE_DT_GET(DT_NODELABEL(spi22));
static const struct i2c_dt_spec adxl367_i2c =
	I2C_DT_SPEC_GET(DT_NODELABEL(adxl367));
static const struct sensor_trigger idle_wake_trigger = {
	.type = SENSOR_TRIG_THRESHOLD,
	.chan = SENSOR_CHAN_ACCEL_XYZ,
};

static uint8_t status_packet[STATUS_PACKET_SIZE];
static uint8_t motion_packet[MOTION_PACKET_SIZE];
static uint8_t motion_ring[MOTION_HISTORY_SAMPLES][MOTION_PACKET_SIZE];
static uint16_t motion_ring_write_index;
static uint16_t motion_ring_count;
static uint8_t motion_window_snapshot[MOTION_WINDOW_BYTES];
static char motion_window_hex[MOTION_WINDOW_HEX_BYTES];
static uint8_t frozen_motion_history[MOTION_HISTORY_SAMPLES][MOTION_PACKET_SIZE];
static uint16_t frozen_motion_count;
static uint32_t frozen_capture_id;
static uint8_t device_id[DEVICE_ID_MAX_SIZE];
static uint8_t device_id_len;
static uint8_t boot_id[BOOT_ID_SIZE];
static char advertising_name[ADVERTISING_NAME_BUFFER_SIZE];
static uint32_t reset_cause;
static uint32_t sequence;
static uint32_t sensor_error_count;
static uint32_t sensor_fault_count;
static uint32_t sensor_recovery_generation;
static uint32_t sensor_recovery_attempt_count;
static uint32_t sensor_recovery_success_count;
static uint32_t sensor_recovery_failure_count;
static uint32_t adxl367_error_streak;
static uint32_t bmi270_error_streak;
static uint32_t last_sensor_error_bits;
static uint64_t last_sensor_error_uptime_ms;
static uint32_t notify_drop_count;
static uint32_t adxl367_clip_count;
static uint32_t bmi270_accel_clip_count;
static uint32_t bmi270_gyro_clip_count;
static bool adxl367_ready;
static bool bmi270_ready;
static atomic_t notify_enabled;
static atomic_t ble_connected;
static atomic_t bluetooth_ready;
static atomic_t power_policy = ATOMIC_INIT(PUTTTRACK_POWER_AUTO);
static atomic_t runtime_state = ATOMIC_INIT(PUTTTRACK_RUNTIME_ACTIVE);
static atomic_t sensor_health = ATOMIC_INIT(PUTTTRACK_SENSOR_HEALTHY);
static uint32_t power_transition_count;
static uint32_t advertising_start_error_count;
static uint32_t power_management_error_count;
static atomic_t bmi270_spi_suspended;
static atomic_t idle_wake_interrupt_enabled;
static atomic_t adxl367_wakeup_mode_enabled;
static atomic_t idle_wake_requested;
static uint32_t current_stream_rate_hz = MOTION_STREAM_RATE_HZ;
static uint32_t current_adxl367_odr_hz = ADXL367_ODR_HZ;
static uint32_t current_bmi270_accel_odr_hz = BMI270_ACCEL_ODR_HZ;
static uint32_t current_bmi270_gyro_odr_hz = BMI270_GYRO_ODR_HZ;
static uint32_t current_adv_interval_min_ms = 100U;
static uint32_t current_adv_interval_max_ms = 150U;
static int64_t last_active_motion_ms;
static int64_t sensor_healthy_since_ms;
static int64_t next_sensor_recovery_ms;
static int64_t last_idle_sensor_health_check_ms;
static uint8_t sensor_recovery_attempts_in_episode;
static int32_t active_previous_adxl[3];
static bool active_previous_adxl_valid;
static int32_t idle_adxl_baseline[3];
static bool idle_adxl_baseline_valid;
static uint8_t idle_wake_samples;
static struct k_work_delayable advertise_work;
static struct sensor_reboot_retention sensor_reboot_retention __noinit;

