ZehuiLi1/putttrack/firmware/nrf54l15_tag_app/src/main.c
#if defined(CONFIG_PUTTTRACK_NFC_SERVICE)
#define NFC_NDEF_BUFFER_SIZE 160U
#define NFC_URI_BUFFER_SIZE 96U
#define NFC_SERVICE_DISCOVERY_WINDOW_MS 10000U

static uint8_t nfc_ndef_buffer[NFC_NDEF_BUFFER_SIZE];
static atomic_t nfc_field_on_count;
static atomic_t nfc_field_off_count;
static atomic_t nfc_field_present;
static atomic_t nfc_service_window_active;
static atomic_t nfc_service_window_open_count;
static atomic_t nfc_service_window_suppressed_count;
static int32_t nfc_setup_error;
static struct k_work nfc_service_window_open_work;
static struct k_work_delayable nfc_service_window_close_work;
#endif

K_MUTEX_DEFINE(packet_mutex);
K_SEM_DEFINE(power_event_sem, 0, 1);

static void build_status_packet(void);
static void begin_sensor_recovery(uint32_t error_bits);

static const char *power_policy_name(enum putttrack_power_policy policy)
{
	switch (policy) {
	case PUTTTRACK_POWER_RESEARCH:
		return "research";
	case PUTTTRACK_POWER_IDLE:
		return "idle";
	case PUTTTRACK_POWER_AUTO:
	default:
		return "auto";
	}
}

static const char *runtime_state_name(enum putttrack_runtime_state state)
{
	return state == PUTTTRACK_RUNTIME_ACTIVE ? "active" : "idle";
}

static const char *sensor_health_name(enum putttrack_sensor_health health)
{
	switch (health) {
	case PUTTTRACK_SENSOR_SUSPECT:
		return "suspect";
	case PUTTTRACK_SENSOR_RECOVERING:
		return "recovering";
	case PUTTTRACK_SENSOR_DEGRADED:
		return "degraded";
	case PUTTTRACK_SENSOR_QUARANTINED:
		return "quarantined";
	case PUTTTRACK_SENSOR_HEALTHY:
	default:
		return "healthy";
	}
}

static void bytes_to_hex(const uint8_t *input, size_t input_len, char *output)
{
	static const char digits[] = "0123456789abcdef";

	for (size_t index = 0; index < input_len; index++) {
		output[index * 2] = digits[input[index] >> 4];
		output[index * 2 + 1] = digits[input[index] & 0x0f];
	}
}

static void initialize_advertising_name(void)
{
	const size_t prefix_len = sizeof(ADVERTISING_NAME_PREFIX) - 1U;
	const size_t suffix_len = MIN((size_t)device_id_len,
				      (size_t)ADVERTISING_NAME_SUFFIX_BYTES);

	memcpy(advertising_name, ADVERTISING_NAME_PREFIX, prefix_len);
	bytes_to_hex(device_id, suffix_len, &advertising_name[prefix_len]);
	advertising_name[prefix_len + suffix_len * 2U] = '\0';
}

static int putttrack_mgmt_status(struct smp_streamer *ctxt)
{
	zcbor_state_t *zse = ctxt->writer->zs;
	enum putttrack_power_policy policy = atomic_get(&power_policy);
	enum putttrack_runtime_state state = atomic_get(&runtime_state);
	enum putttrack_sensor_health health = atomic_get(&sensor_health);
	const char *policy_text = power_policy_name(policy);
	const char *state_text = runtime_state_name(state);
	const char *health_text = sensor_health_name(health);
	char device_id_hex[DEVICE_ID_MAX_SIZE * 2];
	char boot_id_hex[BOOT_ID_SIZE * 2];
	struct zcbor_string device_id_value = {
		.value = (const uint8_t *)device_id_hex,
		.len = device_id_len * 2U,
	};
	struct zcbor_string boot_id_value = {
		.value = (const uint8_t *)boot_id_hex,
		.len = sizeof(boot_id) * 2U,
	};
	struct zcbor_string firmware_value = {
		.value = (const uint8_t *)PUTTTRACK_FIRMWARE_VERSION,
		.len = strlen(PUTTTRACK_FIRMWARE_VERSION),
	};
	struct zcbor_string power_policy_value = {
		.value = (const uint8_t *)policy_text,
		.len = strlen(policy_text),
	};
	struct zcbor_string runtime_state_value = {
		.value = (const uint8_t *)state_text,
		.len = strlen(state_text),
	};
	struct zcbor_string sensor_health_value = {
		.value = (const uint8_t *)health_text,
		.len = strlen(health_text),
	};
	uint32_t status_sequence;
	bool ok;

	bytes_to_hex(device_id, device_id_len, device_id_hex);
	bytes_to_hex(boot_id, sizeof(boot_id), boot_id_hex);
	build_status_packet();
	k_mutex_lock(&packet_mutex, K_FOREVER);
	status_sequence = sys_get_le32(&status_packet[4]);
	k_mutex_unlock(&packet_mutex);

	ok = zcbor_tstr_put_lit(zse, "proto") &&
	     zcbor_uint32_put(zse, PUTTTRACK_PROTOCOL_VERSION) &&
	     zcbor_tstr_put_lit(zse, "seq") &&
	     zcbor_uint32_put(zse, status_sequence) &&
	     zcbor_tstr_put_lit(zse, "uptime_ms") &&
	     zcbor_uint64_put(zse, (uint64_t)k_uptime_get()) &&
	     zcbor_tstr_put_lit(zse, "reset") &&
	     zcbor_uint32_put(zse, reset_cause) &&
	     zcbor_tstr_put_lit(zse, "sensor_errors") &&
	     zcbor_uint32_put(zse, sensor_error_count) &&
	     zcbor_tstr_put_lit(zse, "notify_drops") &&
	     zcbor_uint32_put(zse, notify_drop_count) &&
	     zcbor_tstr_put_lit(zse, "stream_hz") &&
	     zcbor_uint32_put(zse, current_stream_rate_hz) &&
	     zcbor_tstr_put_lit(zse, "adxl_odr_hz") &&
	     zcbor_uint32_put(zse, current_adxl367_odr_hz) &&
	     zcbor_tstr_put_lit(zse, "adxl_range_g") &&
	     zcbor_uint32_put(zse, ADXL367_RANGE_G) &&
	     zcbor_tstr_put_lit(zse, "bmi_accel_odr_hz") &&
	     zcbor_uint32_put(zse, current_bmi270_accel_odr_hz) &&
	     zcbor_tstr_put_lit(zse, "bmi_accel_range_g") &&
	     zcbor_uint32_put(zse, BMI270_ACCEL_RANGE_G) &&
	     zcbor_tstr_put_lit(zse, "bmi_gyro_odr_hz") &&
	     zcbor_uint32_put(zse, current_bmi270_gyro_odr_hz) &&
	     zcbor_tstr_put_lit(zse, "bmi_gyro_range_dps") &&
	     zcbor_uint32_put(zse, BMI270_GYRO_RANGE_DPS) &&
	     zcbor_tstr_put_lit(zse, "adxl_clips") &&
	     zcbor_uint32_put(zse, adxl367_clip_count) &&
	     zcbor_tstr_put_lit(zse, "bmi_accel_clips") &&
	     zcbor_uint32_put(zse, bmi270_accel_clip_count) &&
	     zcbor_tstr_put_lit(zse, "bmi_gyro_clips") &&
	     zcbor_uint32_put(zse, bmi270_gyro_clip_count) &&
	     zcbor_tstr_put_lit(zse, "adxl_ready") &&
	     zcbor_bool_put(zse, adxl367_ready) &&
	     zcbor_tstr_put_lit(zse, "bmi_ready") &&
	     zcbor_bool_put(zse, bmi270_ready) &&
	     zcbor_tstr_put_lit(zse, "device_id") &&
	     zcbor_tstr_encode(zse, &device_id_value) &&
	     zcbor_tstr_put_lit(zse, "boot_id") &&
	     zcbor_tstr_encode(zse, &boot_id_value) &&
	     zcbor_tstr_put_lit(zse, "fw") &&
	     zcbor_tstr_encode(zse, &firmware_value) &&
	     zcbor_tstr_put_lit(zse, "power_policy") &&
	     zcbor_tstr_encode(zse, &power_policy_value) &&
	     zcbor_tstr_put_lit(zse, "runtime_state") &&
	     zcbor_tstr_encode(zse, &runtime_state_value) &&
	     zcbor_tstr_put_lit(zse, "sensor_health") &&
	     zcbor_tstr_encode(zse, &sensor_health_value) &&
	     zcbor_tstr_put_lit(zse, "capture_safe") &&
	     zcbor_bool_put(zse, health == PUTTTRACK_SENSOR_HEALTHY &&
			    adxl367_ready && bmi270_ready &&
			    state == PUTTTRACK_RUNTIME_ACTIVE &&
			    current_stream_rate_hz == MOTION_STREAM_RATE_HZ) &&
	     zcbor_tstr_put_lit(zse, "sensor_faults") &&
	     zcbor_uint32_put(zse, sensor_fault_count) &&
	     zcbor_tstr_put_lit(zse, "recovery_generation") &&
	     zcbor_uint32_put(zse, sensor_recovery_generation) &&
	     zcbor_tstr_put_lit(zse, "recovery_attempts") &&
	     zcbor_uint32_put(zse, sensor_recovery_attempt_count) &&
	     zcbor_tstr_put_lit(zse, "recovery_successes") &&
	     zcbor_uint32_put(zse, sensor_recovery_success_count) &&
	     zcbor_tstr_put_lit(zse, "recovery_failures") &&
	     zcbor_uint32_put(zse, sensor_recovery_failure_count) &&
	     zcbor_tstr_put_lit(zse, "adxl_error_streak") &&
	     zcbor_uint32_put(zse, adxl367_error_streak) &&
	     zcbor_tstr_put_lit(zse, "bmi_error_streak") &&
	     zcbor_uint32_put(zse, bmi270_error_streak) &&
	     zcbor_tstr_put_lit(zse, "last_sensor_error_bits") &&
	     zcbor_uint32_put(zse, last_sensor_error_bits) &&
	     zcbor_tstr_put_lit(zse, "last_sensor_error_ms") &&
	     zcbor_uint64_put(zse, last_sensor_error_uptime_ms) &&
	     zcbor_tstr_put_lit(zse, "auto_reboots") &&
	     zcbor_uint32_put(zse, sensor_reboot_retention.reboot_count) &&
	     zcbor_tstr_put_lit(zse, "auto_reboot_fault_bits") &&
	     zcbor_uint32_put(zse, sensor_reboot_retention.last_fault_bits) &&
	     zcbor_tstr_put_lit(zse, "auto_reboot_guard") &&
	     zcbor_bool_put(zse, sensor_reboot_retention.guard != 0U) &&
	     zcbor_tstr_put_lit(zse, "auto_reboot_pending") &&
	     zcbor_bool_put(zse, health == PUTTTRACK_SENSOR_DEGRADED &&
			    sensor_reboot_retention.guard == 0U) &&
	     zcbor_tstr_put_lit(zse, "idle_health_check_ms") &&
	     zcbor_uint32_put(zse, IDLE_SENSOR_HEALTH_CHECK_MS) &&
	     zcbor_tstr_put_lit(zse, "power_transitions") &&
	     zcbor_uint32_put(zse, power_transition_count) &&
	     zcbor_tstr_put_lit(zse, "idle_timeout_ms") &&
	     zcbor_uint32_put(zse, AUTO_IDLE_TIMEOUT_MS) &&
	     zcbor_tstr_put_lit(zse, "wake_poll_ms") &&
	     zcbor_uint32_put(zse,
			      atomic_get(&idle_wake_interrupt_enabled) != 0 ?
			      0U : IDLE_WAKE_SAMPLE_PERIOD_MS) &&
	     zcbor_tstr_put_lit(zse, "wake_interrupt") &&
	     zcbor_bool_put(zse, atomic_get(&idle_wake_interrupt_enabled) != 0) &&
	     zcbor_tstr_put_lit(zse, "adxl_wakeup_mode") &&
	     zcbor_bool_put(zse, atomic_get(&adxl367_wakeup_mode_enabled) != 0) &&
	     zcbor_tstr_put_lit(zse, "adv_interval_min_ms") &&
	     zcbor_uint32_put(zse, current_adv_interval_min_ms) &&
	     zcbor_tstr_put_lit(zse, "adv_interval_max_ms") &&
	     zcbor_uint32_put(zse, current_adv_interval_max_ms) &&
	     zcbor_tstr_put_lit(zse, "adv_start_errors") &&
	     zcbor_uint32_put(zse, advertising_start_error_count) &&
	     zcbor_tstr_put_lit(zse, "pm_errors") &&
	     zcbor_uint32_put(zse, power_management_error_count) &&
	     zcbor_tstr_put_lit(zse, "bmi_spi_suspended") &&
	     zcbor_bool_put(zse, atomic_get(&bmi270_spi_suspended) != 0) &&
	     zcbor_tstr_put_lit(zse, "battery_supported") &&
	     zcbor_bool_put(zse, false);

