ZehuiLi1/putttrack/firmware/nrf54l15_tag_app/src/main.c
	return ok ? MGMT_ERR_EOK : MGMT_ERR_EMSGSIZE;
}

static int putttrack_mgmt_frozen_chunk(struct smp_streamer *ctxt,
				       uint16_t chunk_index)
{
	zcbor_state_t *zse = ctxt->writer->zs;
	struct zcbor_string data_value;
	uint16_t sample_offset = chunk_index * MOTION_WINDOW_SAMPLES;
	uint16_t sample_count;
	uint16_t total_count;
	uint32_t capture_id;
	uint32_t start_sequence = 0U;
	uint32_t end_sequence = 0U;
	bool ok;

	k_mutex_lock(&packet_mutex, K_FOREVER);
	total_count = frozen_motion_count;
	capture_id = frozen_capture_id;
	if (sample_offset >= total_count) {
		sample_count = 0U;
	} else {
		sample_count = MIN(total_count - sample_offset, MOTION_WINDOW_SAMPLES);
		for (size_t index = 0; index < sample_count; index++) {
			memcpy(&motion_window_snapshot[index * MOTION_PACKET_SIZE],
			       frozen_motion_history[sample_offset + index],
			       MOTION_PACKET_SIZE);
		}
	}
	k_mutex_unlock(&packet_mutex);

	if (sample_count > 0U) {
		start_sequence = sys_get_le32(&motion_window_snapshot[4]);
		end_sequence = sys_get_le32(
			&motion_window_snapshot[(sample_count - 1U) * MOTION_PACKET_SIZE + 4U]);
	}
	bytes_to_hex(motion_window_snapshot,
		     (size_t)sample_count * MOTION_PACKET_SIZE,
		     motion_window_hex);
	data_value = (struct zcbor_string) {
		.value = (const uint8_t *)motion_window_hex,
		.len = (size_t)sample_count * MOTION_PACKET_SIZE * 2U,
	};

	ok = zcbor_tstr_put_lit(zse, "proto") &&
	     zcbor_uint32_put(zse, PUTTTRACK_PROTOCOL_VERSION) &&
	     zcbor_tstr_put_lit(zse, "capture_id") &&
	     zcbor_uint32_put(zse, capture_id) &&
	     zcbor_tstr_put_lit(zse, "chunk_index") &&
	     zcbor_uint32_put(zse, chunk_index) &&
	     zcbor_tstr_put_lit(zse, "sample_size") &&
	     zcbor_uint32_put(zse, MOTION_PACKET_SIZE) &&
	     zcbor_tstr_put_lit(zse, "count") &&
	     zcbor_uint32_put(zse, sample_count) &&
	     zcbor_tstr_put_lit(zse, "start_seq") &&
	     zcbor_uint32_put(zse, start_sequence) &&
	     zcbor_tstr_put_lit(zse, "end_seq") &&
	     zcbor_uint32_put(zse, end_sequence) &&
	     zcbor_tstr_put_lit(zse, "data_hex") &&
	     zcbor_tstr_encode(zse, &data_value);

	return ok ? MGMT_ERR_EOK : MGMT_ERR_EMSGSIZE;
}

#define DEFINE_FROZEN_CHUNK_HANDLER(index)                                      \
	static int putttrack_mgmt_frozen_chunk_##index(struct smp_streamer *ctxt) \
	{                                                                          \
		return putttrack_mgmt_frozen_chunk(ctxt, index);                     \
	}

DEFINE_FROZEN_CHUNK_HANDLER(0)
DEFINE_FROZEN_CHUNK_HANDLER(1)
DEFINE_FROZEN_CHUNK_HANDLER(2)
DEFINE_FROZEN_CHUNK_HANDLER(3)
DEFINE_FROZEN_CHUNK_HANDLER(4)
DEFINE_FROZEN_CHUNK_HANDLER(5)
DEFINE_FROZEN_CHUNK_HANDLER(6)
DEFINE_FROZEN_CHUNK_HANDLER(7)
DEFINE_FROZEN_CHUNK_HANDLER(8)
DEFINE_FROZEN_CHUNK_HANDLER(9)
DEFINE_FROZEN_CHUNK_HANDLER(10)
DEFINE_FROZEN_CHUNK_HANDLER(11)
DEFINE_FROZEN_CHUNK_HANDLER(12)
DEFINE_FROZEN_CHUNK_HANDLER(13)
DEFINE_FROZEN_CHUNK_HANDLER(14)
DEFINE_FROZEN_CHUNK_HANDLER(15)

static int putttrack_mgmt_set_power_policy(
	struct smp_streamer *ctxt, enum putttrack_power_policy policy)
{
	zcbor_state_t *zse = ctxt->writer->zs;
	const char *policy_text = power_policy_name(policy);
	const char *state_text = runtime_state_name(atomic_get(&runtime_state));
	struct zcbor_string policy_value = {
		.value = (const uint8_t *)policy_text,
		.len = strlen(policy_text),
	};
	struct zcbor_string state_value = {
		.value = (const uint8_t *)state_text,
		.len = strlen(state_text),
	};

	atomic_set(&power_policy, policy);
	k_sem_give(&power_event_sem);
	bool ok = zcbor_tstr_put_lit(zse, "accepted") &&
		  zcbor_bool_put(zse, true) &&
		  zcbor_tstr_put_lit(zse, "power_policy") &&
		  zcbor_tstr_encode(zse, &policy_value) &&
		  zcbor_tstr_put_lit(zse, "runtime_state_before_apply") &&
		  zcbor_tstr_encode(zse, &state_value);

	return ok ? MGMT_ERR_EOK : MGMT_ERR_EMSGSIZE;
}

static int putttrack_mgmt_power_auto(struct smp_streamer *ctxt)
{
	return putttrack_mgmt_set_power_policy(ctxt, PUTTTRACK_POWER_AUTO);
}

static int putttrack_mgmt_power_research(struct smp_streamer *ctxt)
{
	return putttrack_mgmt_set_power_policy(ctxt, PUTTTRACK_POWER_RESEARCH);
}

static int putttrack_mgmt_power_idle(struct smp_streamer *ctxt)
{
	return putttrack_mgmt_set_power_policy(ctxt, PUTTTRACK_POWER_IDLE);
}

static const struct mgmt_handler putttrack_mgmt_handlers[] = {
	[PUTTTRACK_MGMT_ID_STATUS] = {
		.mh_read = putttrack_mgmt_status,
		.mh_write = NULL,
	},
	[PUTTTRACK_MGMT_ID_MOTION] = {
		.mh_read = putttrack_mgmt_motion,
		.mh_write = NULL,
	},
	[PUTTTRACK_MGMT_ID_WINDOW] = {
		.mh_read = putttrack_mgmt_window,
		.mh_write = NULL,
	},
	[PUTTTRACK_MGMT_ID_FREEZE_HISTORY] = {
		.mh_read = putttrack_mgmt_freeze_history,
		.mh_write = NULL,
	},
	[4] = {.mh_read = putttrack_mgmt_frozen_chunk_0, .mh_write = NULL},
	[5] = {.mh_read = putttrack_mgmt_frozen_chunk_1, .mh_write = NULL},
	[6] = {.mh_read = putttrack_mgmt_frozen_chunk_2, .mh_write = NULL},
	[7] = {.mh_read = putttrack_mgmt_frozen_chunk_3, .mh_write = NULL},
	[8] = {.mh_read = putttrack_mgmt_frozen_chunk_4, .mh_write = NULL},
	[9] = {.mh_read = putttrack_mgmt_frozen_chunk_5, .mh_write = NULL},
	[10] = {.mh_read = putttrack_mgmt_frozen_chunk_6, .mh_write = NULL},
	[11] = {.mh_read = putttrack_mgmt_frozen_chunk_7, .mh_write = NULL},
	[12] = {.mh_read = putttrack_mgmt_frozen_chunk_8, .mh_write = NULL},
	[13] = {.mh_read = putttrack_mgmt_frozen_chunk_9, .mh_write = NULL},
	[14] = {.mh_read = putttrack_mgmt_frozen_chunk_10, .mh_write = NULL},
	[15] = {.mh_read = putttrack_mgmt_frozen_chunk_11, .mh_write = NULL},
	[16] = {.mh_read = putttrack_mgmt_frozen_chunk_12, .mh_write = NULL},
	[17] = {.mh_read = putttrack_mgmt_frozen_chunk_13, .mh_write = NULL},
	[18] = {.mh_read = putttrack_mgmt_frozen_chunk_14, .mh_write = NULL},
	[19] = {.mh_read = putttrack_mgmt_frozen_chunk_15, .mh_write = NULL},
	[PUTTTRACK_MGMT_ID_POWER_AUTO] = {
		.mh_read = NULL,
		.mh_write = putttrack_mgmt_power_auto,
	},
	[PUTTTRACK_MGMT_ID_POWER_RESEARCH] = {
		.mh_read = NULL,
		.mh_write = putttrack_mgmt_power_research,
	},
	[PUTTTRACK_MGMT_ID_POWER_IDLE] = {
		.mh_read = NULL,
		.mh_write = putttrack_mgmt_power_idle,
	},
};

static struct mgmt_group putttrack_mgmt_group = {
	.mg_handlers = putttrack_mgmt_handlers,
	.mg_handlers_count = ARRAY_SIZE(putttrack_mgmt_handlers),
	.mg_group_id = PUTTTRACK_MGMT_GROUP_ID,
};

static void putttrack_mgmt_register_group(void)
{
	mgmt_register_group(&putttrack_mgmt_group);
}

MCUMGR_HANDLER_DEFINE(putttrack_mgmt, putttrack_mgmt_register_group);

